Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Just like C<print>, but implicitly appends a newline.
es_es: Igual que C<print>, pero implícitamente añade un carácter de nueva línea.

source: =head1 Callbacks
es_es: =head1 Retrollamadas

source: right = += -= *= etc.
es_es: derecha = += -= *= etc.

source: The author of Perl has never felt the need to use this form of C<goto> (in Perl, that is--C is another matter).
es_es: El autor de Perl nunca ha sentido la necesidad de usar esta forma de C<goto> (en Perl, desde luego. C es otra historia).

source: To find out whether a given string is a valid non-zero number, it's sometimes enough to test it against both numeric 0 and also lexical "0" (although this will cause noises if warnings are on).
es_es: Para saber si una cadena dada es un número válido distinto de cero, a veces es suficiente con compararlo con el 0 numérico y también con el "0" léxico (aunque esto provocará ruido si los avisos están activados).

source: C<Sys::Syslog> upgraded to version 0.13
es_es: C<Sys::Syslog> actualizado a la versión 0.13

source: $count = $string =~ /\d+/g;
es_es: $cuenta = $cadena =~ /\d+/g;

source: Checks if the numbered capturing group has matched something.
es_es: Comprueba si el grupo de captura indicado por el número, ha coincidido con algo.

source: C<8 - 4> is evaluated first making the expression C<4 - 2 == 2> and not C<8 - 2 == 6>.
es_es: C<8 - 4> es evaluada primero dejando la expresión C<4 - 2 == 2> y no C<8 - 2 == 6>.

source: The ENFMT stands for
es_es: El ENFMT significa

source: This makes it easy to write loops that terminate when a null list is returned:
es_es: Esto hace que sea fácil escribir bucles que terminan cuando se devuelve una lista vacía:

source: =head1 Core Changes
es_es: =head1 Cambios principales

source: last if eof(); # needed if we're reading from a terminal
es_es: last if eof(); # necesario si estamos leyendo de una terminal

source: with the sequence C<1100> repeating again and again.
es_es: donde la secuencia C<1100> se repite una y otra vez.

# print PASSWD "${who}::0:0:Superuser:/:/bin/perl ";
source: print PASSWD "${who}::0:0:Superuser:/:/bin/perl\n";
es_es: print PASSWD "${quien}::0:0:Superusuario:/:/bin/perl\n";

source: This function allows you to distinguish C<undef> from other values.
es_es: Esta función le permite distinguir C<undef> de otros valores.

source: Hashes are unordered collections of scalar values indexed by their associated string key.
es_es: Los hashes son colecciones no ordenadas de valores escalares indexadas por sus claves asociadas, que son cadenas de caracteres.

source: Strange though this may seem, this is the basis for the whole module import/export system.
es_es: Por extraño que pueda parecer, esta es la base para todo el sistema de importación/exportación en los módulos.

source: There are a number of "magic" scalars with names that look like punctuation or line noise.
es_es: Hay varios escalares "mágicos" con nombres que recuerdan conjuntos de signos de puntuación (o "ruido de señal").

source: The metacharacters are
es_es: Los metacaracteres son

source: This quoting\ Business\ HERE\ ISN\'T\ QUITE\ done\ yet\, is it?
es_es: Este trabajo\ de\ Escapado\ AÚN\ NO\ SE\ HA\ terminado\, ¿no?

source: The internal dump output has been improved, so that non-printable characters such as newline and backspace are output in C<\x> notation, rather than octal.
es_es: La salida del comando interno dump se ha mejorado, de modo que los caracteres no imprimibles, como el nueva línea y la tecla de retroceso se emiten en notación C<\x>, en lugar de octal.

source: =item goto LABEL X<goto> X<jump> X<jmp>
es_es: =item goto ETIQUETA X<goto> X<jump> X<jmp>

source: Note that C<(?=\S)(?<!\S)|(?!\S)(?<=\S)> matches exactly at these positions, so we want to have each C<\Y|> in the place of the more complicated version.
es_es: Note que C<(?=\S)(?<!\S)|(?!\S)(?<=\S)> coincide exactamente con esas posiciones, así que lo que queremos es usar C<\Y|> en lugar de una versión más complicada.

source: Extraneous "?" from C<self_url()> removed
es_es: Un extraño "?" devuelto por C<self_url()>, eliminado

source: =head2 New "Illegal declaration of anonymous subroutine"
es_es: =head2 Nuevo "I<Illegal declaration of anonymous subroutine>" (Declaración ilegal de una subrutina anónima)

source: Verbose modifier C<v> added for C<-DXv> and C<-Dsv>, see L<perlrun>.
es_es: El modificador de detalle C<v> añadido para C<-DXv> y C<-Dsv>, vea L<perlrun>.

source: Various minor bug fixes
es_es: Varios errores menores arreglados

source: If Perl is new (and thus scary) to them, find something that Perl can do to solve one of their problems.
es_es: Si nunca han utilizado Perl y se sienten inseguros, busque alguna tarea en la que Perl les pueda ayudar.

source: Arranges to have a SIGALRM delivered to this process after the specified number of wallclock seconds has elapsed.
es_es: Ordena mandar una señal SIGALRM al proceso actual después de que haya pasado el número de segundos especificados.

source: That means you usually want to use positive not negative signals.
es_es: Eso significa que desea utilizar, generalmente, señales positivas, y no negativas.

source: In scalar context, ".." returns a boolean value.
es_es: En contexto escalar, ".." devuelve un valor booleano.

source: There are several examples below that illustrate these perils.
es_es: Hay varios ejemplos a continuación que ilustran estos peligros.

source: $#whatever = -1;
es_es: $#loquesea = -1;

source: %e a floating-point number, in scientific notation
es_es: %e un número en punto flotante, en notación científica

source: (or regen_uconfig64 if you're editing uconfig64.sh)
es_es: (o regen_uconfig64 si está editando uconfig64.sh)

source: It may not be used to go into any construct that requires initialization, such as a subroutine or a C<foreach> loop.
es_es: No puede ser usado en ninguna construcción que requiera inicialización, como una subrutina o un bucle C<foreach>.

source: Many Unicode tests are skipped when they really should be fixed.
es_es: Muchas pruebas de Unicode se omiten cuando en realidad deberían ser arregladas.

source: =item On ASCII platforms
es_es: =item En plataformas ASCII

source: =item goto &NAME
es_es: =item goto &NOMBRE

source: (In other words, use of C<$[> is deprecated.) So in general you can assume that X<$[>
es_es: (En otras palabras, el uso de C<$[> es obsoleto). Por ello, en general, puede asumir que X<$[>

source: default { print "I don't like anything"
es_es: default { print "No me gusta nada"

source: An C<our> declaration declares a global variable that will be visible across its entire lexical scope, even across package boundaries.
es_es: Una declaración C<our> declara una variable global que será visible en todo su ámbito léxico, incluso a través de las fronteras del paquete.

source: =head1 New or Changed Diagnostics
es_es: =head1 Diagnósticos nuevos y cambiados

source: . 'more '/eg;
es_es: . 'más '/eg;

source: substr($name, 4) = 'dy'; # $name is now 'freddy'
es_es: substr($nombre, 4) = 'ito'; # $nombre es ahora 'pedrito'

source: w A BER compressed integer (not an ASN.1 BER, see perlpacktut for
es_es: w Un entero comprimido en BER (no en ASN.1 BER, ver perlpacktut para los

source: You may need to worry about the networking configuration files discussed in the last bullet below.
es_es: Es posible que tenga que preocuparse de los archivos de configuración de red, discutido en el último punto de más abajo.

source: The module can implement its C<import> method any way it likes, though most modules just choose to derive their C<import> method via inheritance from the C<Exporter> class that is defined in the C<Exporter> module.
es_es: El módulo puede implementar su propio método C<import> de la forma que desee, aunque la mayoría de los módulos sólo eligen derivar su método C<import> vía herencia desde la clase C<Exporter> que se define en el módulo C<Exporter>.

source: =head2 @INC reorganization
es_es: =head2 Reorganización de @INC

source: =head2 Shift Operators X<shift operator> X<operator, shift> X<<< << >>> X<<< >> >>> X<right shift> X<left shift> X<bitwise shift> X<shl> X<shr> X<shift, right> X<shift, left>
es_es: =head2 Operadores de desplazamiento X<shift operator> X<operator, shift> X<<< << >>> X<<< >> >>> X<right shift> X<left shift> X<bitwise shift> X<shl> X<shr> X<shift, right> X<shift, left> X<operador de desplazamiento> X<operador, desplazamiento> X<desplazamiento derecho> X<desplazamiento izquierdo>

source: The Perl functions affected by this are:
es_es: Las funciones Perl afectadas por esto son:

source: C<goto("NE")."XT"> is equivalent to C<goto NEXT>.
es_es: C<goto("NE")."XT"> es equivalente a C<goto NEXT>.

source: One of the guiding mottos for Perl development is "there's more than one way to do it" (TMTOWTDI, sometimes pronounced "tim toady").
es_es: Uno de los lemas que dirigen el desarrollo de Perl es "se puede hacer de varias maneras", que es la traducción de "there's more than one way to do it" (o TMTOWTDI, pronunciado "tim toady").

source: C<Socket> upgraded to version 1.78
es_es: C<Socket> actualizado a la versión 1.78

source: /(a.)+/ matches a string in which every odd-numbered letter is a (eg "abacadaf")
es_es: /(a.)+/ cadena en la que cada letra impar es a (ej. "abacadaf")

source: Now fixed.
es_es: Ahora arreglado.

source: Each semop structure can be generated with C<pack("s!3", $semnum, $semop, $semflag)>.
es_es: Cada estructura semop se puede generar con C<pack("s!3", $semnum, $semop, $semflag)>.

source: (?<NAME_PAT>....)
es_es: (?<NOMBRE_PAT>....)

source: Starting with Perl 5.14, C<shift> can take a scalar EXPR, which must hold a reference to an unblessed array.
es_es: A partir de Perl 5.14, C<shift> puede tomar una EXPR escalar, que debe contener la referencia a un hash o un array no bendecido.

source: Again, C<undef> is returned only once.
es_es: Una vez más, C<undef> sólo se devuelve una vez.

source: C<formline> always returns true.
es_es: C<formline> siempre devuelve verdadero.

source: The discrepancy in the return values in list context is considered a bug by some, and will probably be fixed in a future release.
es_es: La discrepancia en los valores de retorno en el contexto de lista es considerado un error por parte de algunos, y probablemente será corregido en futuras versiones.

source: Each hash or array has its own internal iterator, accessed by C<each>, C<keys>, and C<values>.
es_es: Cada hash o array tiene su iterador interno, accedido por C<each> , C<keys>, y C<values>.

source: const char *name;
es_es: const char *nombre;

source: A hash or array element can be true only if it's defined and defined only if it exists, but the reverse doesn't necessarily hold true.
es_es: Un elemento de un hash o de un array puede ser verdadero sólo si está definido, y está definido solo si ya existe, pero lo inverso no es necesariamente cierto.

source: List assignment in scalar context returns the number of elements produced by the expression on the right side of the assignment:
es_es: Lista de asignación en contexto escalar devuelve el número de elementos producidos por la expresión en el lado derecho de la asignación:

source: is better than
es_es: es mejor que

source: You can now use the C<keys>, C<values>, C<each> builtin functions on arrays (previously you could only use them on hashes).
es_es: Ahora puede usar las funciones incorporadas C<keys>, C<values>, C<each> con arrays (anteriormente sólo se podía utilizar con los hashes).

source: Note that the counting for relative recursion differs from that of relative backreferences, in that with recursion unclosed groups B<are> included.
es_es: Tenga en cuenta que el recuento de la recursión relativa difiere de la de contra-referencias relativas, en que con recursión, los grupos no cerrados B<están> incluidos.

source: When called with a parameter, C<srand> uses that for the seed; otherwise it (semi-)randomly chooses a seed.
es_es: Cuando se llama con un parámetro, C<srand> la usa para la semilla; de lo contrario elige pseudo-aleatoriamente una semilla.

source: A class implementing a scalar should have the following methods:
es_es: Una clase que implementa un escalar debe tener los siguientes métodos:

source: =item getservbyport PORT,PROTO
es_es: =item getservbyport PUERTO,PROTO

source: Only hexadecimal digits are valid following C<\x>.
es_es: Solo están permitidos dígitos hexadecimales si van a continuación de C<\x>.

source: close $in or die "$in: $!";
es_es: close $entrada or die "$entrada: $!";

source: perljp Perl for Japanese (in EUC-JP)
es_es: perljp Perl para japonés (en EUC-JP)

source: Named groups count in absolute and relative numbering, and so can also be referred to by those numbers.
es_es: Los grupos con nombre se numeran de forma absoluta y relativa, por lo que también se puede hacer referencia a ellos con esos números.

source: Returns the semaphore id, or the undefined value on error.
es_es: Devuelve el id del semáforo, o el valor indefinido en caso de error.

source: which lasts until the end of that BLOCK.
es_es: que durará hasta el final de ese BLOQUE.

source: This document describes differences between the 5.9.3 and the 5.9.4 development releases.
es_es: Este documento describe las diferencias entre las versiones de desarrollo 5.9.3 y la 5.9.4.

source: produces the output 'h:i :t:h:e:r:e!'.
es_es: produce la salida 'h:o:l:a :p:o:r :a:q:u:i!'.

source: It can run scripts from the previous major release, Perl 4 (March 1991), but has significant differences.
es_es: Permite ejecutar scripts de la versión principal anterior, Perl 4 (lanzada en marzo de 1991), pero incluye diferencias importantes.

source: left ->
es_es: izquierda ->

source: However, in short:
es_es: Se incluye a continuación un resumen:

source: Checksumming the compressed output of one or more rapidly changing operating system status programs is the usual method.
es_es: El método usual es la suma de control de la salida comprimida de uno o más programas, rápidamente cambiantes, de estado del sistema operativo.

source: In other words, 1.23 times ten to the 99th may be either "1.23e99" or "1.23e099".
es_es: En otras palabras, 1.23 por diez elevado a 99 puede ser "1.23e99" o "1.23e099".

source: Taken together, these features go a long way towards making Perl's regular expressions more readable.
es_es: En conjunto, estas características hacen un gran labor para conseguir que las expresiones regulares de Perl sean más legibles.

source: In scopes where C<use integer;> is in force, nearly all the operators listed above will force their argument(s) into integer format, and return an integer result.
es_es: En ámbitos en los que C<use integer;> está activo, casi todos los operadores indicados arriba forzarán la conversión de sus argumentos a formato de entero, y devolverán un resultado entero.

source: (This always forces interpretation of the LIST as a multivalued list, even if there is only a single scalar in the list.) Example:
es_es: (Esto siempre fuerza la interpretación de la LISTA como una lista multievaluada, incluso si sólo hay un único escalar en la lista). Ejemplo:

source: 3: got AB
es_es: 3: tenemos AB

source: If the delimiter chosen is a single quote, no interpolation is done on either the PATTERN or the REPLACEMENT.
es_es: Si el delimitador elegido es una comilla simple, no se realiza ninguna interpolación, ni en el PATRÓN ni en el REEMPLAZO.

source: They work much like quotes in the standard Unix shells: double-quoted string literals are subject to backslash and variable substitution; single-quoted strings are not (except for C<\'> and C<\\>).
es_es: Funcionan de forma muy parecida a las comillas en las líneas de comandos Unix: literales de cadena entre comillas dobles están sujetos a la barra invertida y la sustitución de variables; cadenas entre comillas simples no lo están (a excepción de C<\'> y C<\\>).

source: /((.)(.)(.)(.)(.)(.)(.)(.)(.))\10/ # \10 is a backreference
es_es: /((.)(.)(.)(.)(.)(.)(.)(.)(.))\10/ # \10 es una contrareferencia

source: Because of the automatic conversion of scalars, operations that return scalars don't need to care (and in fact, cannot care) whether their caller is looking for a string, a number, or a reference.
es_es: Debido a que la conversión de escalares es automática, las operaciones que los devuelven no necesitan tener en cuenta (y, de hecho, no pueden hacerlo), si quien ha hecho la petición está esperando una cadena, un número o una referencia.

source: (In older versions of Perl, programmers would insert curly brackets to force interpretation as a filename glob: C<< <${foo}> >>.
es_es: (En versiones anteriores de Perl, los programadores insertaban llaves para forzar la interpretación como una expansión de nombre de archivo: C<< <$foo{}> >>.

source: So:
es_es: Así:

source: The value of the C<my> variable may be C<undef>, any previously assigned value, or possibly anything else.
es_es: El valor de la variable C<my> puede ser C<undef>, cualquier valor anteriormente asignado, o posiblemente, cualquier otra cosa.

source: die "Can't open $FOO: $!" unless open(FOO);
es_es: die "No puedo abrir $FOO: $!" unless open(FOO);

source: Care should be taken not to cause line number collisions in code you'd like to debug later.
es_es: Hay que tener cuidado para no causar colisiones de números de línea en el código que pretenda depurar más tarde.

source: The C<while> and C<until> modifiers have the usual "C<while> loop" semantics (conditional evaluated first), except when applied to a C<do>-BLOCK (or to the deprecated C<do>-SUBROUTINE statement), in which case the block executes once before the conditional is evaluated.
es_es: Los modificadores C<while> y C<until> tienen la usual semántica de los "bucles C<while>" (la condición se evalúa primero), excepto cuando se aplica a un bloque C<do> (o a la obsoleta instrucción de subrutina C<do>), en cuyo caso el bloque se ejecuta una vez antes de que sea evaluada la condición.

source: That means that if you want to use variables, you must use an eval():
es_es: Esto significa que si quiere usar variables, debe usar eval():

source: That should probably be written more simply as:
es_es: Esto, probablemente, se debe escribir más sencillamente como:

source: If you wanted to have a $ref_to_AoA variable as a reference to an array, you'd have to do something like this:
es_es: Si quería tener una variable $ref_to_AoA como una referencia a un array, tendrá que hacer algo como esto:

source: See also L<"Terms and List Operators (Leftward)">.
es_es: Vea también L<"Términos y Operadores de listas (por la izquierda)">.

source: Binary "cmp" returns -1, 0, or 1 depending on whether the left argument is stringwise less than, equal to, or greater than the right argument.
es_es: Binario "cmp" devuelve -1, 0, o 1 dependiendo de si el argumento de la izquierda es alfanuméricamente menor, igual o mayor que el argumento de la derecha.

source: sleep($for_a_while);
es_es: sleep($por_un_rato);

source: sub ordinal { unpack("W",$_[0]); } # same as ord()
es_es: sub ordinal { unpack("W",$_[0]); } # lo mismo que ord()

source: Do not patch these modules directly!
es_es: No debe aplicar revisiones a estos módulos directamente.

source: This modifier may be specified to be the default by C<use re '/a'> or C<use re '/aa'>, but see L</Which character set modifier is in effect?>.
es_es: Este modificador puede ser especificado para que sea el predeterminado usando C<use re '/a'> o C<use re '/aa'>, pero vea L</¿Qué modificares están activos?>.

source: Use -Doptimize=-g if you want to run Perl under sdb or gdb, OR if you want to be able to use the -D command line flags to perl, which are occasionally useful in debugging perl scripts.
es_es: Use -Doptimize=-g si quiere ejecutar Perl bajo sdb o gdb, O si quiere ser capaz de usar la bandera -D en la línea de comandos con perl, que ocasionalmente es útil en la depuración de scripts perl.

source: C<basename> now strips trailing path separators before processing the name.
es_es: C<basename> ahora elimina separadores finales superfluos antes de procesar el nombre.

source: This is the internal function implementing the C<\L> escape in double-quoted strings.
es_es: Esta es la función interna que implementa el escapado C<\L> en las cadenas entre comillas dobles.

source: Perl's core time-related functions are now Y2038 compliant.
es_es: Las funciones principales de Perl relacionadas con la hora, ahora cumplen con Y2038.

source: OUTER: for my $wid (@ary1) {
es_es: EXTERNO: for my $wid (@array1) {

source: Numbers don't need quotes around them:
es_es: No es necesario escribir los números entre comillas:

# flock($fh, LOCK_UN) or die "Cannot unlock mailbox - $! ";
source: flock($fh, LOCK_UN) or die "Cannot unlock mailbox - $!\n";
es_es: flock($fh, LOCK_UN) or die "No puedo desbloquear el buzón - $!\n";

source: Perl does, and this replaces most structured uses of C<goto> in other languages.)
es_es: Perl sí, y esto reemplaza a la mayor parte de los usos estructurados de C<goto> en otros lenguajes).

source: The C<\G> assertion can be used to chain global matches (using C<m//g>), as described in L<perlop/"Regexp Quote-Like Operators">.
es_es: La aserción C<\G> puede ser usada para encadenar coincidencias globales (usando C<m//g>), como se describe en L<perlop/"Operadores Regexp Entrecomillados">.

source: Note: Many folks tend to overuse C<defined> and are then surprised to discover that the number C<0> and C<""> (the zero-length string) are, in fact, defined values.
es_es: Nota: mucha gente tiende a sobrevalorar C<defined> y, para su sorpresa, descubren que el número C<0> y C<""> (la cadena de longitud cero) son, de hecho, valores definidos.

source: when (/oranges?/) { say "I don't like oranges."
es_es: when (/naranjas?/) { say "No me gustan las naranjas."

source: A scalar value is interpreted as TRUE in the Boolean sense if it is not the null string or the number 0 (or its string equivalent, "0").
es_es: Un valor escalar se interpreta como VERDADERO, en el sentido booleano, si no es la cadena nula ni el número 0 (ni su cadena equivalente "0").

source: printf '<%10.6d>', 1; # prints "< 000001>"
es_es: printf '<%10.6d>', 1; # imprime "< 000001>"

source: The C<next> command is like the C<continue> statement in C; it starts the next iteration of the loop:
es_es: El comando C<next> es como la instrucción C<continue> en C; comienza la siguiente iteración del bucle:

source: This is similar to the "cut group" operator C<::> from Perl 6.
es_es: Este es similar al operador C<::> "grupo de corte" de Perl 6.

source: =head2 C<$#> has been removed
es_es: =head2 C<$#> se ha eliminado

source: However, this isn't the length of the array; it's the subscript of the last element, which is a different value since there is ordinarily a 0th element.
es_es: Sin embargo, esto no es la longitud del array, sino el subíndice del último elemento, que es un valor distinto ya que, ordinariamente, hay un elemento número 0.

source: perlreref Perl regular expressions quick reference
es_es: perlreref Referencia rápida de expresiones regulares

source: Finally, the "." metacharacter matches any character except "\n" (unless you use C</s>).
es_es: Por último, el metacarácter "." coincide con cualquier carácter excepto "\n" (a menos que utilice C</s>).

source: See either the GNU General Public License or the Artistic License for more details.
es_es: Vea, o la Licencia Pública General GNU o la Licencia Artística, para más detalles.

source: 0 dev device number of filesystem
es_es: 0 dev número de dispositivo del sistema de archivos
